# Arquivo contendo as mensagens do sistema

# Pagina /mensagensDeRetorno/erro.jsp
erro.geral = Erro ao executar opera\u00e7\u00e3o!
erro.acessoNegado = Acesso negado! Seu usu\u00e1rio do sistema n\u00e3o possui acesso a esta p\u00e1gina!
erro.sessaoExpirou = Sua sess\u00e3o expirou ou \u00e9 inv\u00e1lida! Por favor insira seu usu\u00e1rio e senha novamente!
falha.validar = Falha ao validar dados \u00fanicos (exemplos: CPF, RG, nome de tratamento, ...) no banco de dados!
falha.salvar = Falha ao salvar dados no banco de dados!
falha.consultar = Falha ao consultar dados no banco de dados!
falha.apagar = Falha ao apagar dados no banco de dados!
falha.consultarGrupoAcesso = Falha ao consultar grupos de acesso no banco de dados!
falha.atualizar = Falha ao atualizar dados no banco de dados!
falha.inserirDentista = Falha ao inserir registro de dentista no banco de dados ao tentar atualizar cargo de funcion\u00e1rio comum para dentista!
falha.formatarData = Falha ao formatar campo de data!
falha.incluirFicha.filaOrcamento = Falha ao incluir ficha do paciente na fila de atendimento de or\u00e7amentos!
falha.identificar.usuarioLogado = Falha ao tentar identificar o usu\u00e1rio logado!
falha.identificar.atendimento = Falha ao tentar identificar o registro deste atendimento!
falha.identificar.dente = Falha ao tentar identificar o registro do dente!
falha.identificar.ficha = Falha ao tentar identificar a ficha do paciente!
falha.identificar.formaPagamento = Falha ao tentar identificar a forma de pagamento!
falha.continuar.orcamento = Falha ao tentar continuar atendimento de or\u00e7amento!
falha.capturar.registros.chequesBancarios = Falha ao capturar registros de cheques banc\u00e1rios!
falha.capturar.registros.comprovantesPagamentosCartao = Falha ao capturar registros de comprovantes de pagamentos com cart\u00e3o!
falha.valorFinal.naoConfere = Falha! Valor final n\u00e3o confere!

# Pagina /mensagensDeRetorno/advertencia.jsp
ficha.jaEstaNaFilaAtendimentoOrcamento = A ficha deste paciente j\u00e1 est\u00e1 na fila de atendimento de or\u00e7amentos!
ficha.jaEstaNaFilaAtendimentoTratamento = A ficha deste paciente j\u00e1 est\u00e1 na fila de atendimento de tratamentos!
funcionario.naoEhDentista = \u00c9 preciso ter cargo de dentista para esta opera\u00e7\u00e3o!
nomeDeUsuario.jaExiste = Este nome de usu\u00e1rio j\u00e1 esta sendo usado! Escolha outro...
cpf.jaExiste = CPF j\u00e1 cadastrado no sistema!
rg.jaExiste = RG j\u00e1 cadastrado no sistema!
cro.jaExiste = CRO j\u00e1 cadastrado no sistema!
nome.procedimento.jaExiste = Nome de procedimento j\u00e1 cadastrado no sistema!
descricao.procedimento.jaExiste = Descri\u00e7\u00e3o de procedimento j\u00e1 cadastrada no sistema!
nome.formaPagamento.jaExiste = Nome de forma de pagamento j\u00e1 cadastrado no sistema!
descricao.formaPagamento.jaExiste = Descri\u00e7\u00e3o de forma de pagamento j\u00e1 cadastrada no sistema!
obrigatorios.emBranco = Favor preencher todos os campos obrigat\u00f3rios!
naoEhRegistroDeOrcamento = N\u00e3o \u00e9 poss\u00edvel realizar esta opera\u00e7\u00e3o, pois o registro n\u00e3o est\u00e1 com status "or\u00e7ado".
naoEhRegistroLiberado = N\u00e3o \u00e9 poss\u00edvel realizar esta opera\u00e7\u00e3o, pois o registro n\u00e3o est\u00e1 com status "liberado (pago)".
naoEhRegistroEmTratamento = N\u00e3o \u00e9 poss\u00edvel realizar esta opera\u00e7\u00e3o, pois o registro n\u00e3o est\u00e1 com status "em tratamento".
naoEhRegistroPagoOuTratando = N\u00e3o \u00e9 poss\u00edvel realizar esta opera\u00e7\u00e3o, pois este registro n\u00e3o est\u00e1 com status "pago" ou "em tratamento"!
paciente.inativo = N\u00e3o foi poss\u00edvel realizar esta opera\u00e7\u00e3o, pois o paciente est\u00e1 INATIVO no sistema!
atendimento.iniciadoOuRemovidoDaFila = Atendimento j\u00e1 iniciado ou removido da fila de atendimento!
valorMinimo.naoAtingido = O valor final do pagamento \u00e9 menor que o valor m\u00ednimo!
valorMinimo.invalido = Valor m\u00ednimo inv\u00e1lido!
valorCobrado.invalido = Valor cobrado inv\u00e1lido!
saldo.insuficiente = Saldo insuficiente! O paciente n\u00e3o possui cr\u00e9dito suficiente!

# Pagina /login/loginErro.jsp
falha.validarUsuario = Falha ao validar usu\u00e1rio e senha no banco de dados!
falha.consultar.usuario = Falha ao consultar usu\u00e1rio no banco de dados!
falha.registrar.usuario.sessao = Falha ao registrar usu\u00e1rio na sess\u00e3o!
nomeDeUsuarioOuSenha.invalido = Nome de usu\u00e1rio ou senha de acesso inv\u00e1lidos!
senha.invalida = Senha inv\u00e1lida!